`Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_caller_identity.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.invoke-lambda-on-schedule will be created
  + resource "aws_cloudwatch_event_rule" "invoke-lambda-on-schedule" {
      + arn                 = (known after apply)
      + description         = "This Event bridge Invokes Lambda function on a Schedule"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "invoke-lambda-scheduler-qppsf-dev"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 16 ? * * *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.ddbackup-invoke-lambda will be created
  + resource "aws_cloudwatch_event_target" "ddbackup-invoke-lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "invoke-lambda-scheduler-qppsf-dev"
      + target_id      = "invoke-ddb-lambda"
    }

  # aws_iam_policy.lambda_cloudwatch_logging will be created
  + resource "aws_iam_policy" "lambda_cloudwatch_logging" {
      + arn         = (known after apply)
      + description = "IAM permissions for Lambda to Create Log Group"
      + id          = (known after apply)
      + name        = "ddbackup_lambda_cloudwatch_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.lambda_ddb_backups will be created
  + resource "aws_iam_policy" "lambda_ddb_backups" {
      + arn         = (known after apply)
      + description = "IAM permission to list dynamo Db Backups"
      + id          = (known after apply)
      + name        = "dynamodb_backup_lambda_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:DescribeTable",
                          + "dynamodb:Scan",
                          + "dynamodb:DescribeBackup",
                          + "dynamodb:ListGlobalTables",
                          + "dynamodb:ListTables",
                          + "dynamodb:ListBackups",
                          + "dynamodb:ListStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:003384571330:table/qpp-qrda3converter-prod-metadata/backup/*",
                          + "arn:aws:dynamodb:us-east-1:003384571330:table/qpp-qrda3converter-prod-metadata",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.lambda_executionrole will be created
  + resource "aws_iam_role" "lambda_executionrole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dynamodbbackup_lambda_executionrole-qppsf-dev"
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cloudwatchlogs-lambda will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatchlogs-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dynamodbbackup_lambda_executionrole-qppsf-dev"
    }

  # aws_iam_role_policy_attachment.dynamodb-lambda will be created
  + resource "aws_iam_role_policy_attachment" "dynamodb-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dynamodbbackup_lambda_executionrole-qppsf-dev"
    }

  # aws_lambda_function.ddb-notification-alerts will be created
  + resource "aws_lambda_function" "ddb-notification-alerts" {
      + arn                            = (known after apply)
      + filename                       = "dynamo-db-bckup-notifier.zip"
      + function_name                  = "dynamo-db-bckup-notifier"
      + handler                        = "dynamo-db-bckup-notifier.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "channel_id"            = "GA20H9QJW"
              + "slack_channel_webhook" = "https://hooks.slack.com/services/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"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = "dynamo-db-bckup-notifier"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }`